{"300379660": {"lang": "en", "prefLabel": "indigenous people", "altLabels": ["indigenous person", "indigenous peoples", "aboriginal peoples", "indigenous populations", "native peoples", "aborigines", "indigenes", "people, indigenous"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "The original, or earliest known, inhabitants of a colony or country."}, "300016593": {"lang": "en", "prefLabel": "Berber (culture or style)", "altLabels": ["Berbers (cultures or styles)"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": null}, "300435249": {"lang": "en", "prefLabel": "Black (general, race and ethnicity)", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "General designation for the race, ethnicity, styles, culture, and heritage of people of sub-Saharan African origin or descent in places outside Africa, or of members of any dark-skinned group of peoples, including those of  Australian Aboriginal origin or descent."}, "300244536": {"lang": "en", "prefLabel": "Caucasian (culture or style)", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Refers to the people, styles, and cultures originating in the general Caucasus region, which is the area between the Black and Caspian Seas, surrounding the Caucasus mountains, comprising roughly the modern nations of Georgia, Armenia, Azerbaijan, southern parts of Russia, and northeastern Turkey. It refers specifically to the Indo-European and Turkic cultures that have occupied the area since around the first millennium BCE. It takes its name from the Caucasus tribes that settled here; was home to Milesian Greeks, subsequently was invaded numerous times; legendary site of Jason's quest for Golden Fleece; the Caucasus mountains have traditionally been the boundary separating Europe from Asia; however, the area is more subject to Asian influence and so is more often grouped with Asia in modern scholarship."}, "300379994": {"lang": "en", "prefLabel": "developing countries", "altLabels": ["developing country", "Third World", "emerging nations", "developing nations", "least-developed countries", "less-developed countries", "LDCs", "countries, developing"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Refers to countries with low per capita income and an undeveloped industrial base relative to other countries."}, "300025921": {"lang": "en", "prefLabel": "handicapped", "altLabels": ["handicapped's", "disabled", "disabled people"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Those burdened with an encumbrance or disadvantage, physical or mental, that may hinder their ability to cope with the demands of daily life."}, "300236748": {"lang": "en", "prefLabel": "dwarfs", "altLabels": ["dwarf", "dwarf's", "dwarfs'", "dwarves"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "People who are abnormally small in stature."}, "300017447": {"lang": "en", "prefLabel": "Eskimo (culture or style)", "altLabels": ["Eskimo Tradition"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Refers to artwork produced by native Arctic culture, prior to European contact. For names of specific native peoples of the present, use descriptors such as \"Chugach,\" \"Inuit,\" or \"Katladlit.\""}, "300191997": {"lang": "en", "prefLabel": "ethnic groups", "altLabels": ["ethnic group", "groups, ethnic"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Subgroups within a larger cultural or social order that are distinguished from the majority and each other by their national, religious, linguistic, cultural, or sometimes racial background. For groups that are the objects of prejudice or discrimination from the majority, use \"minorities.\""}, "300250435": {"lang": "en", "prefLabel": "ethnicity", "altLabels": ["ethnic", "ethnic group identity", "ethnic identity"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "The perception of identity, distinctiveness, and significance of a group that shares a linguistic group, religious belief, nationality, cultural tradition, or perceived physiological characteristics."}, "300449024": {"lang": "en", "prefLabel": "developed countries", "altLabels": ["developed country", "developed world", "First World"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Describes nations of the world that are considered economically and technologically advanced. Generally consider this more current and accurate than \"First World.\""}, "300055188": {"lang": "en", "prefLabel": "homosexuality", "altLabels": ["homosexual (sexuality)", "gay (general homosexuality)", "queer (homosexual)"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Sexuality characterized by romantic love or sexual desire toward members of one's own sex."}, "300404070": {"lang": "en", "prefLabel": "Rom (culture)", "altLabels": ["Roma (culture)", "Gypsy", "Gipsy"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "The culture and ethnic group of the traditionally itinerant people who originated in northern India but live in modern times worldwide, principally in Europe. Most Roma speak some form of Romani a language closely related to the modern Indo-European languages of northern India, as well as the major language of the country in which they live. It is generally agreed that Roma groups left India in repeated migrations and that they were in Persia by the 11th century, in southeastern Europe by the beginning of the 14th, and in western Europe by the 15th century. By the second half of the 20th century they had spread to every inhabited continent."}, "300386060": {"lang": "en", "prefLabel": "hermaphrodites (people)", "altLabels": ["intersex people", "intersexuals", "intersexual (people)", "hermaphrodite (person)"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "People that are born with both male and female sex organs. Historically the term 'hermaphrodite' has been used in this context, but now prefer 'intersex people'. Reserve use of the term 'hermaphrodite' for the context of organisms that can produce both gametes associated with male and female sexes."}, "300435115": {"lang": "en", "prefLabel": "homosexuals (people)", "altLabels": ["homosexual (person)"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "People having sexual attraction or sexual relations with others of the same sex."}, "300016575": {"lang": "en", "prefLabel": "Khoikhoi", "altLabels": ["Hottentot"], "prefLabel_comment": "meaning \"men of men\"", "altLabel_comment": "now considered pejorative, used after 1652/mid-20th century; probably invented by the Dutch colonists in imitation of the clicking sounds of their language", "scopeNote": "Refers to the people and culture of southern Africa whom the first European explorers found in areas of the hinterland and who now live either in European settlements or on official reserves in South Africa or Namibia. Most Khoikhoi are either Nama or Oorlams, the latter term denoting remnants of the \"Cape Hottentots\" together with many of hybrid descent. The main Nama concentrations are the Bondelswarts, Rooinasie, Swartboois, and Topnaars; the main Orlams groups are the Witbooi, Amraal, Berseba, and Bethanie. The Khoikhoi are not easily distinguishable physically from the San, the Khoikhoi's slightly taller stature and decidedly longer and narrower head being the only marked differences."}, "300025844": {"lang": "en", "prefLabel": "immigrants", "altLabels": ["immigrant", "immigrant's", "immigrants'"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "People who enter a country or region from another to settle there. For those who depart from their native or usual country or region to live elsewhere, use \"emigrants.\""}, "300017437": {"lang": "en", "prefLabel": "Native American", "altLabels": ["American Indian", "Indigenous American", "Indian (Native American)", "Native (Native American)", "American, Native", "Indian, American", "Native Americans"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Whenever possible, use the specific tribal name. The general term \"Native American\" is widely used in the United States, but many groups now prefer \"American Indian\" or \"Indigenous American.\" This concept is typically reserved to refer narrowly to the cultures of the native peoples of the United States and Canada, excluding the Eskimos and Aleuts. For the indigenous peoples of Canada use the term \"First Nations.\" For the broader concept of the cultures of any native peoples of Central America, South America, North America, or the West Indies who are considered to belong to the Mongoloid division of the human species, use \"Amerindian (culture).\""}, "300386794": {"lang": "en", "prefLabel": "Indo-European (culture)", "altLabels": ["Japhetic"], "prefLabel_comment": null, "altLabel_comment": "Japheth, one of the sons of the Biblical Noah", "scopeNote": "Ancient cultures of the peoples associated with broad class of cognate languages that are still spoken over the greater part of Europe and extending into Asia as far as northern India. Included are the cultures associated with the existing and extinct language families of Anatolian, Hellenic, Indo-Iranian, Italic, Celtic, Germanic, Tocharian, Balto-Slavic, Armenian, Albanian, Illyrian, Venetic, Liburnian, Messapian, Phrygian, Paionian, Thracian, Ancient Macedonian, Ligurian, Sicel, and Lusitanian, among others."}, "300017455": {"lang": "en", "prefLabel": "Inuit (Canadian Arctic Native style)", "altLabels": ["Canadian Eskimo", "Eskimo, Canadian"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": null}, "300443390": {"lang": "en", "prefLabel": "Maroon", "altLabels": ["maroon"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Style and culture of a community or group of formerly enslaved Africans and Amerindian peoples and their descendants who fled, resisted, or rebelled against enslavement and found freedom in remote regions near where they had been forcibly relocated. Many of these groups have survived in the Caribbean and the Americas. Note that this community of people did not originally refer to themselves as “Maroon,” though some of their contemporary descendants have adopted the term, while others may consider it pejorative."}, "300218522": {"lang": "en", "prefLabel": "shamans", "altLabels": ["shaman", "shamans'", "shaman's", "medicine men", "medicine women", "men, medicine", "women, medicine"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Those who act as intermediaries between the natural and supernatural worlds, serving as healers and priests, foretelling the future, and controlling spiritual forces for the welfare of the community."}, "300265512": {"lang": "en", "prefLabel": "Metis", "altLabels": ["Métis"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Refers to the culture of the Metis, peoples of mixed French-Canadian and Native American ancestry."}, "300073715": {"lang": "en", "prefLabel": "Islam", "altLabels": ["Islamic (religion)", "Islamism", "Mohammedan", "Mohammedanism", "Moslem", "Muhammadanism", "Muslim", "Muslimism", "Mussulmanism", "mahométanisme", "islamisme"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Refers to the religious beliefs and social practices founded in the seventh century by the Arabian Prophet Muhammad, held to be the last of a series of major prophets, which include, according to Islamic dogma, Adam, Noah, and Jesus. It later spread throughout the Middle East, Africa, Europe, and parts of Asia. It is characterized by the belief in the fundamental idea that a devotee 'surrenders' and submits his will to Allah, the prime creator and sustainer of the universe and all creation. In Islam, God is unique and has no partner or intermediary as in the Christian Trinity. Social service and the active alleviation of suffering in others is considered the only path to salvation and prayer and sacred ritual alone are inadequate forms of submission to Allah. The Qur'an (Koran), the sacred text of the religion, is a compilation of revelations from Allah believed to have been received by Muhammad."}, "300375152": {"lang": "en", "prefLabel": "Maure", "altLabels": ["Maures", "Moor (culture or style)", "Mauri (Arab-Berber culture or style)"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Style and culture of a people of mixed Arab-Berber descent inhabiting the Western Sahara, neighboring parts of Morocco, Mali, Algeria, and the Islamic Republic of Mauritania. To refer to the products, style and culture of people living within the boundaries of Mauritania proper use \"Mauritanian.\""}, "300018125": {"lang": "en", "prefLabel": "African American", "altLabels": ["Afro-American", "Black (African American)", "Negro (African American)"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Designates the styles, culture, and heritage of  Americans of African descent in North America. The styles capture the essence of the African American experience and how personal and political rebellion and triumphs over prejudice and social adversity have enriched and contributed to the music, art, and literature of American culture as a whole."}, "300018279": {"lang": "en", "prefLabel": "Asian", "altLabels": ["Oriental (Asian)"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Refers to the cultures of the continent of Asia, which is in the eastern hemisphere, and is bounded by the Pacific Ocean, the Indian Ocean, the Arctic Ocean, and is generally considered to be delimited on the west by the Ural Mountains. It also refers to the numerous islands off the coast of Asia."}, "300056500": {"lang": "en", "prefLabel": "primitive art", "altLabels": ["art, primitive"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "An outdated designation formerly used for the art of certain people considered to be outside the spheres of influence of other, politically dominant cultural groups; was used especially concerning communities in sub-Saharan Africa, the Pacific Islands, and native tribal groups throughout the Americas. Use instead \"indigenous art,\" \"tribal art,\" or the most specific name known for the culture of origin. Distinct from \"primitivism,\" a term sometimes used for artistic styles or movements intended, often romantically or sentimentally, to emulate the appearance of art made by people operating outside of mainstream art markets."}, "300056548": {"lang": "en", "prefLabel": "primitivism (artistic concept)", "altLabels": ["neoprimitivism", "neo-primitivism"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "A term sometimes used for artistic styles or movements intended, often romantically or sentimentally, to emulate the appearance of art that was formerly designated primitive and other art made by people operating outside of mainstream art markets. Distinct from \"primitive art\" and \"primitive architecture,\" which are outdated terms formerly used for art and architecture of certain people considered to be outside the spheres of influence of other, politically dominant cultural groups. For the Russian art movement, active from about 1905 to 1920, which combined influences from Russian folk art with ideas borrowed from Cubism and Futurism, use \"Primitivist.\""}, "300016430": {"lang": "en", "prefLabel": "Pygmy (African culture or style)", "altLabels": ["Pigmy (African culture or style)", "Bakola (Pygmy, culture or style)"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "The collective style and culture of various African peoples whose adult males grow to less than 59 inches (150 cm) in average height, and who live in Cameroon, Equatorial Guinea, Gabon, Democratic Republic of Congo, Congo Republic, Central African Republic, Rwanda, and Burundi. Use of \"Pygmy\" for a culture is considered pejorative; where possible use instead the most specific name for the subgroup."}, "300256475": {"lang": "en", "prefLabel": "race (group of people)", "altLabels": ["races (groups of people)", "peoples (races)"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Identification of a group of people as distinct from other groups on the basis of physical or socially defined characteristics, such as the color of skin or language."}, "300025925": {"lang": "en", "prefLabel": "intellectually disabled", "altLabels": ["mentally retarded"], "prefLabel_comment": null, "altLabel_comment": "term is considered offensive", "scopeNote": "People having any of several conditions characterized by subnormal intellectual functioning and impaired adaptive behavior that are identified during the individual’s developmental years."}, "300025874": {"lang": "en", "prefLabel": "servants", "altLabels": ["servant", "servant's", "servants'"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Generally in historical usage, for people who are privately employed to perform personal or household services."}, "300230899": {"lang": "en", "prefLabel": "enslaved people", "altLabels": ["enslaved person", "enslaved persons", "slaves (people)", "slave (person)", "slave's (person's )", "slaves' (peoples')", "people, enslaved"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Those who are treated as the property of and are entirely subject to another person, whether by capture, purchase, or birth."}, "300435679": {"lang": "en", "prefLabel": "traditional cultural properties", "altLabels": ["traditional cultural property", "traditional cultural places", "TCP"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "In the US, sites that are eligible for inclusion in the National Register because of their association with cultural practices or beliefs of a living community that are rooted in that community's history, and are important in maintaining the continuing cultural identity of the community."}, "300400510": {"lang": "en", "prefLabel": "LGBTQ+", "altLabels": ["LGBT", "lesbian, gay, bisexual, and transgender", "lesbian, gay, bisexual, transgender/transsexual/transvestite", "L.G.B.T.Q.", "LGB", "GLBT", "LGBTQ"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "General term for lesbian, gay, bisexual, or transgender / transsexual / transvestite attractions or behavior."}, "300049946": {"lang": "en", "prefLabel": "tribes (kinship groups)", "altLabels": ["tribe (kinship group)", "tribal societies"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Social, cultural groups, the members of which are held to be descended from a common ancestor, composed of numerous families, clans, or villages. They typically occupy a specific geographic territory, possess cultural, religious, and linguistic homogeneity, and are united politically under one head or chief."}}