{"300021862": {"lang": "nl", "prefLabel": "Australisch Aboriginal", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Beschrijft de diverse soorten kunstwerken die zijn vervaardigd door de oorspronkelijke bewoners van Australië en hun afstammelingen. In de meeste gebieden van Australië worden tegenwoordig traditionele kunstvormen geproduceerd, maar veel Aboriginalkunstenaars beginnen inmiddels ook met allerlei andere media te werken, onder invloed van de mondialisering."}, "300025925": {"lang": "nl", "prefLabel": "zwakbegaafden", "altLabels": ["zwakbegaafde", "achterlijken", "minderbegaafden"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Mensen wiens intellectuele vermogen beduidend beneden het gemiddelde ligt en van wie het sociale aanpassingsvermogen hierdoor wordt benadeeld."}, "300025874": {"lang": "nl", "prefLabel": "bedienden", "altLabels": ["bediende", "dienaren"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "In algemene zin, personen die in dienst van particulieren persoonlijke of huishoudelijke werkzaamheden uitvoeren."}, "300016593": {"lang": "nl", "prefLabel": "Berbers", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": null}, "300236748": {"lang": "nl", "prefLabel": "dwergen", "altLabels": ["dwerg"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Personen die uitzonderlijk klein van gestalte zijn."}, "300017447": {"lang": "nl", "prefLabel": "Eskimo", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Wordt gebruikt met betrekking tot de inheemse Arctische cultuur vóór contact met Europa. Gebruik termen zoals 'Chugach', 'Inuit' of 'Katlâdlit' voor namen van specifieke, hedendaagse inheemse volkeren."}, "300250435": {"lang": "nl", "prefLabel": "etniciteit", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "De perceptie van identiteit, onderscheidende kenmerken en betekenis die een groep met gezamelijke taalkundige, godsdienstige, nationale en soms raciale of andere culturele kenmerken heeft."}, "300191997": {"lang": "nl", "prefLabel": "etnische groepen", "altLabels": ["etnische groep"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Subgroepen binnen een grotere culturele of sociale groep die zich onderscheiden van de meerderheid en van elkaar door hun nationale, religieuze, taalkundige, culturele of soms raciale achtergronden. Gebruik 'minderheden' voor groepen die het doelwit zijn van vooroordelen of discriminatie door de meerderheid."}, "300025921": {"lang": "nl", "prefLabel": "gehandicapten", "altLabels": ["gehandicapte", "invaliden"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Zij die gebukt gaan onder een lichamelijke of geestelijke belemmering die hen kan beperken in hun mogelijkheden om te voldoen aan de eisen van het dagelijks leven."}, "300386060": {"lang": "nl", "prefLabel": "hermafrodieten", "altLabels": ["hermafrodiet"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Mensen die zowel mannelijke als vrouwelijke geslachtsorganen hebben."}, "300055188": {"lang": "nl", "prefLabel": "homoseksualiteit", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Seksualiteit die wordt gekenmerkt door romantische gevoelens of seksueel verlangen naar hetzelfde geslacht."}, "300017437": {"lang": "nl", "prefLabel": "Indiaans", "altLabels": ["Amerikaans Indiaans", "Inheems Amerikaans"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Verwijst meestal naar de cultuur van de inheemse bevolking van het westelijk halfrond, en in het bijzonder naar de inheemse bevolking van Noord-Amerika, met uitzondering van de Eskimo's en Aleoeten. De term wordt ook wel in breder verband gebruikt om te verwijzen naar de cultuur van alle oorspronkelijke bewoners van Noord-, Midden- en Zuid-Amerika en West-Indië die tot het Mongoolse ras worden gerekend. In het Nederlands wordt voor dit brede begrip vaak de term 'indiaan(s)' gebruikt, terwijl 'Native American' uitsluitend verwijst naar de culturen van de inheemse inwoners van de Verenigde Staten en Canada met uitzondering van de Eskimo's en de Aleoeten. Inheemse volkeren van Canada gebruiken de term ‘First Nations’ om naar hun eigen gemeenschappen te verwijzen; vaak gebruiken ze deze term ook in bredere zin om naar alle inheemse volkeren van Noord-, Midden- en Zuid-Amerika te verwijzen."}, "300418042": {"lang": "nl", "prefLabel": "Nederlands-Indisch", "altLabels": ["Nederlands-Indonesisch"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Stijlen en cultuur die behoren tot koloniale periode in toenmalig Nederlands-Indië, nu Indonesië."}, "300386794": {"lang": "nl", "prefLabel": "Indo-Europees", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Oude culturen van de volkeren die horen bij de brede klasse verwante talen die nog steeds worden gesproken in het grootste deel van Europa en tot aan Noord-India in Azië. Het betreft onder andere de culturen die horen bij de volgende bestaande en uitgestorven taalfamilies: Anatolisch, Helleens, Indo-Iraans, Italisch, Keltisch, Germaans, Tochaars, Balto-Slavisch, Armeens, Albanees, Illyrisch, Venetisch, Liburnisch, Messapisch, Frygisch, Paionisch, Thracisch, Oudmacedonisch, Ligurisch, Sjekelesj en Lusitanisch."}, "300379660": {"lang": "nl", "prefLabel": "inheemse bevolking", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "De oorspronkelijke of vroegst bekende bewoners van een kolonie of land."}, "300017455": {"lang": "nl", "prefLabel": "Inuit", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": null}, "300244536": {"lang": "nl", "prefLabel": "Kaukasisch", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": null}, "300265512": {"lang": "nl", "prefLabel": "Metis", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Verwijst naar de cultuur van de Metis, volkeren van gemengde Frans-Canadese of inheems Amerikaanse oorsprong."}, "300387497": {"lang": "nl", "prefLabel": "Mongools", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Stijl en cultuur van de Centraal-Aziatische Mongoolse etnografische groep van nauw verwante tribale volkeren die vooral op de Mongoolse Hoogvlakte leven en dezelfde taal spreken en dezelfde nomadentradities kennen. Gebruik 'Mongools (moderne nationaliteit)' voor de nationaliteit of cultuur van de moderne staat Mongolië."}, "300021016": {"lang": "nl", "prefLabel": "Moors (culture or style)", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Verwijst in algemene zin naar de stijl van kunst, architectuur en materiële cultuur die is vervaardigd door islamitische Noord-Afrikanen, met inbegrip van de kolonisten van het Iberisch Schiereiland en hun afstammelingen van Noord-Afrikaanse en gemengd Noord-Afrikaanse en Iberische afkomst. De stijl kende een bloeiperiode van ongeveer van de 8ste tot de 15de eeuw in Spanje en de Noord-Afrikaanse regio Mauritanië (het tegenwoordige Marokko en een deel van Algerije). Ook daarna wist de stijl zich op kleinere schaal te handhaven, en nog altijd worden er elementen uit toegepast. Zie 'Maure' voor de stijl die is ontwikkeld en wordt gebruikt door de bevolking van de tegenwoordige Islamitische Republiek Mauritanië, een land in West-Afrika."}, "300379994": {"lang": "nl", "prefLabel": "ontwikkelingslanden", "altLabels": ["ontwikkelingsland"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Verwijst naar landen met een laag inkomen per hoofd van de bevolking en een weinig ontwikkelde industriële basis in vergelijking met andere landen."}, "300056548": {"lang": "nl", "prefLabel": "primitivisme", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Artistieke stijlen of stromingen die bedoeld zijn om, vaak op romantische of sentimentele gronden, het uiterlijk na te bootsen van kunstvormen die daarvoor als primitief werden bestempeld. Te onderscheiden van 'primitieve kunst' en 'primitieve architectuur', termen die voorheen werden gebruikt om kunst en architectuur aan te duiden van volkeren die niet onder invloed staan van de dominante westerse cultuur. Gebruik 'primitivistisch' voor op de volkskunst, het kubisme en het futurisme gebaseerde kunst in Rusland in het eerste kwart van de 20e eeuw."}, "300016430": {"lang": "nl", "prefLabel": "Pygmee", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Te gebruiken om werken te beschrijven van bepaalde Afrikaanse volkeren die leven in Kameroen, Equatoriaal-Guinea, de Democratische Republiek Congo, Congo, de Centraal-Afrikaanse Republiek, Rwanda en Burundi. De term Pygmee heeft soms een negatieve bijklank. Waar mogelijk verdient het gebruik van de specifieke naam van een subgroep de voorkeur."}, "300256475": {"lang": "nl", "prefLabel": "ras (begrip)", "altLabels": [""], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Vaststelling van de identiteit van een groep mensen ter onderscheiding van andere groepen, op basis van fysieke of sociale kenmerken, zoals taal."}, "300230899": {"lang": "nl", "prefLabel": "slaven", "altLabels": ["slaaf"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Personen die worden behandeld als een bezit en totaal ondergeschikt zijn aan een ander persoon door gevangenneming, aankoop of geboorte."}, "300049946": {"lang": "nl", "prefLabel": "stammen", "altLabels": ["stam", "volksstammen"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "Sociale groepen waarvan de leden geacht worden af te stammen van een gemeenschappelijke voorouder, en die bestaan uit talrijke families, geslachten of dorpen. Meestal bewonen ze een specifiek geografisch gebied, zijn ze homogeen op cultureel, religieus en taalkundig gebied en zijn ze politiek verenigd door één leider of hoofdman."}, "300404070": {"lang": "nl", "prefLabel": "Roma", "altLabels": ["zigeuners"], "prefLabel_comment": null, "altLabel_comment": null, "scopeNote": "De cultuur en de etnische groep van de traditioneel rondreizende mensen die afkomstig zijn uit Noord-India maar tegenwoordig over de hele wereld wonen, hoofdzakelijk in Europa. De meeste Roma spreken een vorm van Romani, een taal die nauw verwant is aan moderne Indo-Europese talen van Noord-India, maar ze spreken ook de belangrijkste taal van het land waar ze wonen. Roma-groepen trokken waarschijnlijk in herhaalde migratiegolven weg uit India, en waren in Perzië in de 11e eeuw, in Zuidoost-Europa in het begin van de 14e eeuw en in West-Europa in de 15e eeuw. In de tweede helft van de 20e eeuw hadden ze zich inmiddels verspreid naar elk bewoond continent."}}